blogs/《理解Unix进程》阅读笔记(一).html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8aa4b57">1. 进程皆有标识</a></li>
<li><a href="#orga4d9dd9">2. 进程皆有父</a></li>
<li><a href="#orgeed5992">3. 进程皆有文件描述符</a></li>
<li><a href="#org86da2dd">4. 进程皆有资源限制</a></li>
<li><a href="#org5135f56">5. 进程皆有环境变量</a></li>
<li><a href="#orgfca7997">6. 进程皆有参数</a></li>
<li><a href="#org7456472">7. 进程皆有名</a></li>
<li><a href="#org299dee8">8. 进程皆有退出码</a>
<ul>
<li><a href="#orgce1b5e4">8.1. 退出进程的方法</a>
<ul>
<li><a href="#org38a60c5">8.1.1. Kernel#exit</a></li>
<li><a href="#orgdb5a3c1">8.1.2. Kernel#exit!</a></li>
<li><a href="#orgbf77d16">8.1.3. Kernel#abort</a></li>
<li><a href="#orgc1907e0">8.1.4. Kernel#raise</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org84ea1d4">9. 总结</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
本书只有100页，但对于只是长期写代码却对unix底层缺乏了解的大部分程序员很有帮助，译者翻译的通俗易懂，书中介绍了Unix进程的相关概念，通讯方法等，并且在最后对Unicorn，Resque等使用unix编程的项目进行了详细的介绍。
</p>
</blockquote>

<p>
一切代码都是在进程中运行的。
</p>

<div id="outline-container-org8aa4b57" class="outline-2">
<h2 id="org8aa4b57"><span class="section-number-2">1</span> 进程皆有标识</h2>
<div class="outline-text-2" id="text-1">
<p>
进程标示符称为pid，pid，em&#x2026;就是一个ID，ruby查看pid的方法
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">puts</span> <span style="color: #c0c5ce;">Process</span>.pid
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4d9dd9" class="outline-2">
<h2 id="orga4d9dd9"><span class="section-number-2">2</span> 进程皆有父</h2>
<div class="outline-text-2" id="text-2">
<p>
系统的每一个进程都有一个父进程。
</p>

<blockquote>
<p>
疑惑：那第一个进程的父进程是什么？
</p>
</blockquote>

<p>
一般进程的父进程就是调用它的那个进程，比如我们在irb里面调用一个进程，那么该进程的父进程就是irb的进程，查看父进程pid的方法
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">puts</span> <span style="color: #c0c5ce;">Process</span>.ppid
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeed5992" class="outline-2">
<h2 id="orgeed5992"><span class="section-number-2">3</span> 进程皆有文件描述符</h2>
<div class="outline-text-2" id="text-3">
<p>
可以文件描述符就是打开文件的"foreign<sub>key</sub>"，在Unix中，万物皆视为为文件，开启一个进程势必会打开一个文件，其实这里的文件称为资源更好，那么文件描述符实际上是标示了某个被进程操作的资源，如套接字，管道等等。
每个资源只能被打开一次，如果后面的进程需要打开这个资源，需要先将这个资源关闭。
</p>

<div class="org-src-container">
<pre class="src src-ruby">passwd = <span style="color: #c0c5ce;">File</span>.open<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'/etc/passwd'</span> <span style="color: #8c8c8c;">)</span>
<span style="color: #d08770;">puts</span> passwd.fileno

hosts= <span style="color: #c0c5ce;">File</span>.open<span style="color: #8c8c8c;">(</span> <span style="color: #a3be8c;">'/etc/hosts'</span><span style="color: #8c8c8c;">)</span>
<span style="color: #d08770;">puts</span> hosts.fileno

null = <span style="color: #c0c5ce;">File</span>.open<span style="color: #8c8c8c;">(</span> <span style="color: #a3be8c;">'/dev/null'</span> <span style="color: #8c8c8c;">)</span>
<span style="color: #d08770;">puts</span> null.fileno
</pre>
</div>

<p>
输出
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">3</span>
<span style="color: #d08770;">4</span>
<span style="color: #d08770;">3</span>
</pre>
</div>

<p>
因此能够看出
</p>

<pre class="example">
1. 分配的文件描述符是尚未使用的最小值
2. 资源一旦关闭，之前它的文件描述符就又可以使用了
</pre>

<p>
每个unix进程生成之处，都会自动打开三个资源，分别是
</p>

<pre class="example">
1. 标准输入：STDIN // 文件描述符：0
2. 标准输出：STDOUT // 文件描述符：1
3. 标准错误：STDERR // 文件描述符：2
</pre>
</div>
</div>

<div id="outline-container-org86da2dd" class="outline-2">
<h2 id="org86da2dd"><span class="section-number-2">4</span> 进程皆有资源限制</h2>
<div class="outline-text-2" id="text-4">
<p>
进程资源的限制分为软限制和硬限制
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">p</span> <span style="color: #c0c5ce;">Process</span>.getrlimit<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:NOFILE</span><span style="color: #8c8c8c;">)</span>
<span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; [2560, 9223372036854775807]</span>
</pre>
</div>

<pre class="example">
   软限制：自定义的限制，超出后报异常，可以更改，这个数字为能够打开的资源数
   硬限制：只有超级客户可以更改硬限制, 上面那个超大的数实际上就是没有限制的意思
</pre>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #c0c5ce;">Process</span>.setrlimit<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:NOFILE</span>, <span style="color: #d08770;">3</span><span style="color: #8c8c8c;">)</span>

<span style="color: #c0c5ce;">Process</span>.getrlimit<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:NOFILE</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5135f56" class="outline-2">
<h2 id="org5135f56"><span class="section-number-2">5</span> 进程皆有环境变量</h2>
<div class="outline-text-2" id="text-5">
<p>
环境变量是包含进程数据的键值对。进程从其父进程那里集成环境变量。
环境变量在ruby中是通过ENV传递的
</p>
<div class="org-src-container">
<pre class="src src-ruby">$ <span style="color: #c0c5ce;">MESSAGE</span>=<span style="color: #a3be8c;">'wing it'</span> ruby -e <span style="color: #a3be8c;">"puts ENV['MESSAGE']"</span>
</pre>
</div>

<p>
注意ENV并不是一个Hash
</p>
</div>
</div>

<div id="outline-container-orgfca7997" class="outline-2">
<h2 id="orgfca7997"><span class="section-number-2">6</span> 进程皆有参数</h2>
<div class="outline-text-2" id="text-6">
<p>
所有的进程都可以传递参数，参数会封装成为一个称为ARGV的数组
</p>

<div class="org-src-container">
<pre class="src src-ruby">$ ruby argv.rb foo bar

<span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; ARGV = ['foo', 'bar']</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7456472" class="outline-2">
<h2 id="org7456472"><span class="section-number-2">7</span> 进程皆有名</h2>
<div class="outline-text-2" id="text-7">
<p>
也就是每个进程都有个name字段，ruby中可以通过$PROGRAM<sub>NAME获得</sub>，比如irb进程的名称就叫做irb
</p>

<div class="org-src-container">
<pre class="src src-ruby">irb
&gt; <span style="color: #d08770;">puts</span> <span style="color: #d08770;">$PROGRAM_NAME</span>
</pre>
</div>

<p>
by the way，进程名称也可以修改，直接赋值即可
</p>
</div>
</div>

<div id="outline-container-org299dee8" class="outline-2">
<h2 id="org299dee8"><span class="section-number-2">8</span> 进程皆有退出码</h2>
<div class="outline-text-2" id="text-8">
<p>
进程退出的时候会更新上一个退出码，用于表明退出时的情况，退出码=0时表示顺利退出，其他表示出现了错误
</p>
</div>

<div id="outline-container-orgce1b5e4" class="outline-3">
<h3 id="orgce1b5e4"><span class="section-number-3">8.1</span> 退出进程的方法</h3>
<div class="outline-text-3" id="text-8-1">
<p>
在ruby中退出进程的方法有下面几种
</p>
</div>

<div id="outline-container-org38a60c5" class="outline-4">
<h4 id="org38a60c5"><span class="section-number-4">8.1.1</span> Kernel#exit</h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">exit</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#24847;&#21619;&#30528;&#20197;0&#20316;&#20026;&#36864;&#20986;&#30721;&#36864;&#20986;</span>
<span style="color: #d08770;">exit</span> <span style="color: #d08770;">22</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#24378;&#21046;&#25351;&#23450;&#19968;&#20010;&#36864;&#20986;&#30721;</span>
<span style="color: #d08770;">at_exit</span> <span style="color: #8c8c8c;">{</span> <span style="color: #d08770;">puts</span> <span style="color: #a3be8c;">"exit hook!"</span> <span style="color: #8c8c8c;">}</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">at_exit&#26159;exit&#30340;&#38057;&#23376;&#26041;&#27861;&#65292;&#36864;&#20986;&#26102;&#20250;&#25191;&#34892;block</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb5a3c1" class="outline-4">
<h4 id="orgdb5a3c1"><span class="section-number-4">8.1.2</span> Kernel#exit!</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
和exit的区别是exit!的退出码为1，且不会执行at<sub>exit</sub>
</p>
</div>
</div>

<div id="outline-container-orgbf77d16" class="outline-4">
<h4 id="orgbf77d16"><span class="section-number-4">8.1.3</span> Kernel#abort</h4>
<div class="outline-text-4" id="text-8-1-3">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">abort</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#36864;&#20986;&#30721;&#20026;1     </span>
<span style="color: #d08770;">at_exit</span> <span style="color: #8c8c8c;">{</span> <span style="color: #d08770;">puts</span> <span style="color: #a3be8c;">"last!"</span> <span style="color: #8c8c8c;">}</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#20250;&#35843;&#29992;at_exit</span>
<span style="color: #d08770;">abort</span> <span style="color: #a3be8c;">"some error"</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#21487;&#20197;&#25351;&#23450;STDERR</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc1907e0" class="outline-4">
<h4 id="orgc1907e0"><span class="section-number-4">8.1.4</span> Kernel#raise</h4>
<div class="outline-text-4" id="text-8-1-4">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">raise</span> <span style="color: #a3be8c;">'hell'</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#36864;&#20986;&#30721;&#20026;1&#65292;&#19988;&#20250;&#35843;&#29992;at_exit</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org84ea1d4" class="outline-2">
<h2 id="org84ea1d4"><span class="section-number-2">9</span> 总结</h2>
<div class="outline-text-2" id="text-9">
<p>
如果把进程看成一个的table，那么它包含的字段如下
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">pid</th>
<th scope="col" class="org-right">parent<sub>id</sub></th>
<th scope="col" class="org-left">resource<sub>ids</sub></th>
<th scope="col" class="org-left">env</th>
<th scope="col" class="org-left">argv</th>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-right">exit<sub>code</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">123</td>
<td class="org-right">122</td>
<td class="org-left">[0,1,2,3&#x2026;]</td>
<td class="org-left">{"MESSAGE": "bala", "EDITOR": "emacs"}</td>
<td class="org-left">['foo', 'bar']</td>
<td class="org-left">irb</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.13)</p>
</div>
</div>
</body>
</html>
